In [1]:
import pandas as pd

In [2]:
titanic_train=pd.read_csv("titanic_train.csv")

In [3]:
titanic_test=pd.read_csv("titanic_test.csv")

In [4]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic_train.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis=1,inplace=True)

In [6]:
titanic_train.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
titanic_train.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [8]:
titanic_train["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [9]:
titanic_train["Age"].fillna(titanic_train["Age"].mean(),inplace=True)

In [10]:
titanic_train["Age"].isnull().sum()

0

In [11]:
sex_dummies=pd.get_dummies(titanic_train["Sex"],drop_first=True)

In [12]:
titanic_train=pd.concat([titanic_train,sex_dummies],axis=1)

In [13]:
titanic_train.head()

   Survived  Pclass     Sex   Age     Fare  male
0         0       3    male  22.0   7.2500     1
1         1       1  female  38.0  71.2833     0
2         1       3  female  26.0   7.9250     0
3         1       1  female  35.0  53.1000     0
4         0       3    male  35.0   8.0500     1

In [14]:
titanic_train.drop(["Sex"],axis=1,inplace=True)

In [15]:
titanic_train.head()

   Survived  Pclass   Age     Fare  male
0         0       3  22.0   7.2500     1
1         1       1  38.0  71.2833     0
2         1       3  26.0   7.9250     0
3         1       1  35.0  53.1000     0
4         0       3  35.0   8.0500     1

In [16]:
from sklearn.preprocessing import StandardScaler
sts=StandardScaler()

In [17]:
feature_scale=["Age","Fare"]

In [18]:
titanic_train[feature_scale]=sts.fit_transform(titanic_train[feature_scale])

In [19]:
titanic_train.head()

   Survived  Pclass       Age      Fare  male
0         0       3 -0.592481 -0.502445     1
1         1       1  0.638789  0.786845     0
2         1       3 -0.284663 -0.488854     0
3         1       1  0.407926  0.420730     0
4         0       3  0.407926 -0.486337     1

In [20]:
y=titanic_train["Survived"]
x=titanic_train.drop(["Survived"],axis=1)

In [21]:
from sklearn.model_selection import GridSearchCV
from sklearn.svm import SVC

In [22]:
svc_predict=SVC(C=100,kernel="rbf")

In [23]:
svc_predict.fit(x,y)

SVC(C=100)

In [24]:
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [25]:
titanic_test1=titanic_test.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis=1)

In [26]:
titanic_test1.isnull().sum()

Pclass     0
Sex        0
Age       86
Fare       1
dtype: int64

In [27]:
titanic_test1["Age"].fillna(titanic_test1["Age"].mean(),inplace=True)

In [28]:
titanic_test1["Fare"].fillna(titanic_test1["Fare"].mean(),inplace=True)

In [29]:
titanic_test1.head()

   Pclass     Sex   Age     Fare
0       3    male  34.5   7.8292
1       3  female  47.0   7.0000
2       2    male  62.0   9.6875
3       3    male  27.0   8.6625
4       3  female  22.0  12.2875

In [30]:
sex_dummies=pd.get_dummies(titanic_test1["Sex"],drop_first=True)

In [31]:
titanic_test1=pd.concat([titanic_test1,sex_dummies],axis=1)
titanic_test1.drop(["Sex"],axis=1,inplace=True)

In [32]:
titanic_test1.head()

   Pclass   Age     Fare  male
0       3  34.5   7.8292     1
1       3  47.0   7.0000     0
2       2  62.0   9.6875     1
3       3  27.0   8.6625     1
4       3  22.0  12.2875     0

In [33]:
titanic_test1[feature_scale]=sts.fit_transform(titanic_test1[feature_scale])

In [34]:
y_predicted=svc_predict.predict(titanic_test1)

In [35]:
submission=pd.DataFrame({
    "PassengerId":titanic_test["PassengerId"],
    "Survived":y_predicted
})

In [36]:
print(submission)

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [37]:
submission.to_csv("Titanic 2.csv",index=False)